package week5;

public class Ex3_강의과제3_1_행렬 {

	public static void main(String[] args) {

		int[][] m = new int[5][7];

		m[0][0] = 0; m[0][1] = 0; m[0][2] = 1; m[0][3] = 0; m[0][4] = 0; m[0][5] = 0; m[0][6] = 3;

		m[1][0] = 0; m[1][1] = 0; m[1][2] = 0; m[1][3] = 0; m[1][4] = 2; m[1][5] = 5; m[1][6] = 0;

		m[2][0] = 4; m[2][1] = 0; m[2][2] = 0; m[2][3] = 2; m[2][4] = 0; m[2][5] = 1; m[2][6] = 1;

		m[3][0] = 2; m[3][1] = 0; m[3][2] = 0; m[3][3] = 3; m[3][4] = 2; m[3][5] = 0; m[3][6] = 0;

		m[4][0] = 0; m[4][1] = 0; m[4][2] = 3; m[4][3] = 2; m[4][4] = 0; m[4][5] = 2; m[4][6] = 0;
		
		
		for (int i = 0; i < 5; i++) {
			for (int j = 0; j < 7; j++) {
				System.out.print(m[i][j]);
				
				System.out.print(" ");
				
			}
			System.out.println("");
		}

	}

}
